app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT "companies".* FROM "companies" WHERE (ondernemingsnummer = '0820.371.560')

  def show
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1

  def edit
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1

  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("beschrijving", "contactpersoon", "created_at", "dinsdag", "donderdag", "email", "gemeente", "geschiedenis", "huisnummer", "logo_url", "maandag", "naam", "ondernemingsnummer", "regio", "sector", "straat", "telefoonnummer", "updated_at", "vrijdag", "wachtwoord", "website", "woensdag", "zaterdag", "zondag") VALUES ('DJ', 'Jens Verstuyft', '2010-10-22 09:52:31.513289', 'Onbekend', 'Onbekend', 'jens.verstuyft@howest.be', '9230 Wetteren', 'Nog te vervolledigen', '8', '', 'Onbekend', 'Wired For Sound', '0820.371.560', 'Oost-Vlaanderen', 'Amussement', 'Langestraat', '0471/96 85 74', '2010-10-22 09:52:31.513289', 'Onbekend', 'jens', 'http://www.wireforsound.be', 'Onbekend', 'Onbekend', 'Onbekend')

  def update
    @company = Company.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
UPDATE "companies" SET "beschrijving" = 'DJ''s voor al uw feesten.', "updated_at" = '2010-10-22 10:13:39.606895' WHERE ("companies"."id" = 1)

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 980190962) LIMIT 1
DELETE FROM "companies" WHERE ("companies"."id" = 980190962)